app/Livewire/Forms/EditTripForm.php

    public function mount($trip)
    {
        $this->trip = $trip;
        $this->cacheKey = 'trip_' . $this->trip->tripID;

        // Load trip data from cache or database
        $cachedTrip = Cache::get($this->cacheKey);
---
select * from `trips` where `trips`.`tripID` = 'c011f222-d972-4a38-ba98-2d0a232896a8' limit 1

    public function removeCost($index){

        if(isset($this->tripCosts[$index])){
            unset($this->tripCosts[$index]);


        try{
            $tripModel = TripsModel::findOrFail($tripID);
---
select * from `trips` where `trips`.`tripID` = '6880dd2f-d39a-41fe-b424-98b3d439294a' limit 1