app/Livewire/Forms/Search.php

select `tripID`, `tripLocation`, `tripDescription`, `tripLandscape`, `tripAvailability`, `tripStartDate`, `tripEndDate`, `tripPhoto` from `trips` where `tripLocation` LIKE '%jack%' or `tripDescription` LIKE '%jack%' or `tripLandscape` LIKE '%jack%' or `tripAvailability` LIKE '%jack%' or `tripStartDate` LIKE '%jack%' or `tripEndDate` LIKE '%jack%'
select `testimonialID`, `name`, `testimonial` from `testimonials` where `name` LIKE '%jack%' or `email` LIKE '%jack%' or `testimonial` LIKE '%jack%' or `testimonial_approval_status` LIKE '%jack%'
select `bookingID`, `name`, `email`, `phone_number`, `stripe_product_id` from `bookings` where `bookingID` LIKE '%jack%' or `name` LIKE '%jack%' or `email` LIKE '%jack%' or `phone_number` LIKE '%jack%' or `address_line_1` LIKE '%jack%' or `address_line_2` LIKE '%jack%' or `city` LIKE '%jack%' or `state` LIKE '%jack%' or `zip_code` LIKE '%jack%'
---
    public function search()
    {
        $this->validate();

        try {
            $tripsResults = TripsModel::where('tripLocation', 'LIKE', "%{$this->searchQuery}%")
                ->orWhere('tripDescription', 'LIKE', "%{$this->searchQuery}%")
                ->orWhere('tripLandscape', 'LIKE', "%{$this->searchQuery}%")
                ->orWhere('tripAvailability', 'LIKE', "%{$this->searchQuery}%")
                ->orWhere('tripStartDate', 'LIKE', "%{$this->searchQuery}%")
                ->orWhere('tripEndDate', 'LIKE', "%{$this->searchQuery}%")
                ->select('tripID', 'tripLocation', 'tripDescription', 'tripLandscape', 'tripAvailability', 'tripStartDate', 'tripEndDate', 'tripPhoto')
                ->get()
                ->toArray();

            $testimonialsResults = Testimonials::where('name', 'LIKE', "%{$this->searchQuery}%")
                ->orWhere('email', 'LIKE', "%{$this->searchQuery}%")
                ->orWhere('testimonial', 'LIKE', "%{$this->searchQuery}%")
                ->orWhere('testimonial_approval_status', 'LIKE', "%{$this->searchQuery}%")
                ->select('testimonialID', 'name', 'testimonial')
                ->get()
                ->toArray();

        $bookingResults = BookingModel::where('bookingID', 'LIKE', "%{$this->searchQuery}%")
        ->orWhere('name', 'LIKE', "%{$this->searchQuery}%")
        ->orWhere('email', 'LIKE', "%{$this->searchQuery}%")
        ->orWhere('phone_number', 'LIKE', "%{$this->searchQuery}%")
        ->orWhere('address_line_1', 'LIKE', "%{$this->searchQuery}%")
        ->orWhere('address_line_2', 'LIKE', "%{$this->searchQuery}%")
        ->orWhere('city', 'LIKE', "%{$this->searchQuery}%")
        ->orWhere('state', 'LIKE', "%{$this->searchQuery}%")
        ->orWhere('zip_code', 'LIKE', "%{$this->searchQuery}%")
        ->select('bookingID', 'name', 'email', 'phone_number', 'stripe_product_id')
        ->get()
        ->toArray();