app/Livewire/Forms/TestimonialForm.php

    public function mount()
    {
        $this->extraFields = new HoneypotData();
        $this->trips = TripsModel::select('tripID', 'tripLocation')
            ->where('tripStartDate', '<', Carbon::now())
            ->orWhere('tripEndDate', '<', Carbon::now())
            ->get()
            ->toArray();
---
select `tripID`, `tripLocation` from `trips` where `tripStartDate` < '2024-09-10 17:19:32' or `tripEndDate` < '2024-09-10 17:19:32'