app/Livewire/Forms/Testimonialform.php

    public function mount()
    {
        $this->extraFields = new HoneypotData();
         $this->isHomePage = \Route::currentRouteName() === '/';
        $this->trips = TripsModel::select('tripID', 'tripLocation')
            ->where('tripStartDate', '<', Carbon::now())
            ->orWhere('tripEndDate', '<', Carbon::now())
            ->get()
            ->toArray();
---
select `tripID`, `tripLocation` from `trips` where `tripStartDate` < '2024-09-13 05:51:22' or `tripEndDate` < '2024-09-13 05:51:22'