app/Http/Controllers/Admin.php

    public function dashboardPage()
    {
        // $directories = [
        //     storage_path('app/public/booking_photos'),
        // ];

        // // Calculate storage usage
        // $storageData = $this->calculateStorageUsage($directories);

        // // Format storage values
        // $usedStorage = $this->formatSize($storageData['usedSpace']);
        // $totalStorage = $this->formatSize($storageData['totalSpace']);
        // $remainingStorage = $this->formatSize($storageData['freeSpace']);

        $charges = $this->stripe->charges->all();

        // Get all non-refunded transactions
        $transactions = array_filter($charges->data, function ($charge) {
            return !$charge->refunded;
        });

        // Fetch bookings and reservations
        $bookings = BookingModel::with('trip')
        ->select('bookingID', 'name', 'stripe_checkout_id', 'stripe_product_id', 'tripID', 'created_at')
        ->get();

            $reservations = Reservations::select('reservationID', 'name', 'email', 'phone_number', 'address_line_1', 'address_line_2', 'city', 'state', 'zip_code', 'stripe_product_id')->get();
---
select * from `trips` where `trips`.`tripID` in (13463200)
select `bookingID`, `name`, `stripe_checkout_id`, `stripe_product_id`, `tripID`, `created_at` from `bookings`
select `reservationID`, `name`, `email`, `phone_number`, `address_line_1`, `address_line_2`, `city`, `state`, `zip_code`, `stripe_product_id` from `reservations`

        });

        // Fetch the most popular booking based on the number of entries
        $mostPopularBooking = BookingModel::select('stripe_product_id')
            ->selectRaw('COUNT(*) as booking_count')
            ->groupBy('stripe_product_id')
            ->having('booking_count', '>', 1)
            ->orderByDesc('booking_count')
            ->first();
---
select `stripe_product_id`, COUNT(*) as booking_count from `bookings` group by `stripe_product_id` having `booking_count` > 1 order by `booking_count` desc limit 1

    public function bookingInfo($bookingID)
    {
        try {
            $booking = BookingModel::findOrFail($bookingID);
---
select * from `bookings` where `bookings`.`bookingID` = '9225dde8-688f-4c1b-ad01-65dac63789c9' limit 1

    public function allTripsPage(){
        $trips = TripsModel::select('tripID', 'tripLocation', 'tripPhoto', 'tripLandscape', 'tripAvailability', 'tripStartDate', 'tripEndDate', 'tripPrice')->get();
---
select `tripID`, `tripLocation`, `tripPhoto`, `tripLandscape`, `tripAvailability`, `tripStartDate`, `tripEndDate`, `tripPrice` from `trips`

    public function getTripDetails($tripID) {
        try {
            // Retrieve trip details
            $trip = TripsModel::where('tripID', $tripID)->firstOrFail();
---
select * from `trips` where `tripID` = '6880dd2f-d39a-41fe-b424-98b3d439294a' limit 1