app/Http/Controllers/Home.php

select `stripe_product_id`, COUNT(*) as booking_count from `bookings` group by `stripe_product_id` having `booking_count` > 1 order by `booking_count` desc limit 4
---
    public function destinationsPage(){
        $trips = TripsModel::select('tripID', 'tripLocation', 'tripPhoto', 'tripLandscape', 'tripAvailability', 'tripStartDate', 'tripEndDate', 'tripPrice')->get();
         // Find the top 4 most popular bookings with more than one entry
         $mostPopularBookings = BookingModel::select('stripe_product_id')
         ->selectRaw('COUNT(*) as booking_count')
         ->groupBy('stripe_product_id')
         ->having('booking_count', '>', 1) // Ensure only bookings with more than 1 entry are considered
         ->orderByDesc('booking_count')
         ->take(4) // Get the top 4 most popular bookings
         ->get();