app/Http/Controllers/Home.php

select `tripID`, `tripLocation`, `tripPhoto`, `tripLandscape`, `tripAvailability`, `tripStartDate`, `tripEndDate`, `tripPrice`, `stripe_product_id` from `trips`
select * from `testimonials` where `testimonial_approval_status` = 'Approved'
select `bookings`.`stripe_product_id`, COUNT(*) as booking_count from `bookings` inner join `trips` on `bookings`.`stripe_product_id` = `trips`.`stripe_product_id` group by `bookings`.`stripe_product_id`, `trips`.`tripID`, `trips`.`tripPhoto` having `booking_count` > 2 order by `booking_count` desc limit 4
select * from `trips` where `stripe_product_id` = 'prod_QpFIsKcGyFemHX' limit 1
---
    public function homePage()
    {
        $trips = TripsModel::select('tripID', 'tripLocation', 'tripPhoto', 'tripLandscape', 'tripAvailability', 'tripStartDate', 'tripEndDate', 'tripPrice', 'stripe_product_id')->get();
        $testimonials = Testimonials::with('trip')->where('testimonial_approval_status', 'Approved')->get();

        // Find the top 4 most popular bookings with more than one entry
        $mostPopularBookings = BookingModel::select('bookings.stripe_product_id', DB::raw('COUNT(*) as booking_count'))
            ->join('trips', 'bookings.stripe_product_id', '=', 'trips.stripe_product_id')
            ->groupBy('bookings.stripe_product_id', 'trips.tripID', 'trips.tripPhoto')
            ->having('booking_count', '>', 2)
            ->orderByDesc('booking_count')
            ->take(4)
            ->get();

        $popularTrips = [];
        $mostPopularTripId = null;
        $highestBookingCount = 0;

        foreach ($mostPopularBookings as $booking) {
            $product = $this->stripe->products->retrieve($booking->stripe_product_id);

            $trip = TripsModel::where('stripe_product_id', $booking->stripe_product_id)->first();

select * from `trips` where `tripID` = 'c44f9b1c-5dee-4a9e-85f0-27c4e47dc7b2' limit 1
select * from `testimonials` where `tripID` = 'c44f9b1c-5dee-4a9e-85f0-27c4e47dc7b2' and `testimonial_approval_status` = 'approved'
select `stripe_product_id`, COUNT(*) as booking_count from `bookings` group by `stripe_product_id` having `booking_count` > 1 order by `booking_count` desc limit 1
---
    public function getDestinationDetails($tripID){
        $trip = TripsModel::where('tripID', $tripID)->firstOrFail();
        $testimonials = Testimonials::with('trip')
            ->where('tripID', $tripID)
            ->where('testimonial_approval_status', 'approved')
            ->get();
        $averageTestimonialRating = $testimonials->isNotEmpty() ? $testimonials->avg('trip_rating') : 0;

        // Retrieve the most popular booking
        $mostPopularBooking = BookingModel::select('stripe_product_id')
            ->selectRaw('COUNT(*) as booking_count')
            ->groupBy('stripe_product_id')
            ->having('booking_count', '>', 1) // only bookings with more than 1 entry are considered
            ->orderByDesc('booking_count')
            ->first();

select `tripID`, `tripLocation`, `tripPhoto`, `tripLandscape`, `tripAvailability`, `tripStartDate`, `tripEndDate`, `tripPrice`, `stripe_product_id` from `trips`
select * from `testimonials` where `testimonial_approval_status` = 'Approved'
select `bookings`.`stripe_product_id`, COUNT(*) as booking_count from `bookings` inner join `trips` on `bookings`.`stripe_product_id` = `trips`.`stripe_product_id` group by `bookings`.`stripe_product_id`, `trips`.`tripID`, `trips`.`tripPhoto` having `booking_count` > 2 order by `booking_count` desc limit 4
select * from `trips` where `stripe_product_id` = 'prod_QpVAAPUKnNubFf' limit 1
---
    public function destinationsPage(){
       // Fetch all trips
       $trips = TripsModel::select('tripID', 'tripLocation', 'tripPhoto', 'tripLandscape', 'tripAvailability', 'tripStartDate', 'tripEndDate', 'tripPrice', 'stripe_product_id')->get();

       // Fetch approved testimonials
       $testimonials = Testimonials::with('trip')->where('testimonial_approval_status', 'Approved')->get();

       // Find the top 4 most popular bookings with more than one entry
       // Find the top 4 most popular bookings with more than one entry
       $mostPopularBookings = BookingModel::select('bookings.stripe_product_id', DB::raw('COUNT(*) as booking_count'))
       ->join('trips', 'bookings.stripe_product_id', '=', 'trips.stripe_product_id')
       ->groupBy('bookings.stripe_product_id', 'trips.tripID', 'trips.tripPhoto')
       ->having('booking_count', '>', 2)
       ->orderByDesc('booking_count')
       ->take(4)
       ->get();

   $popularTrips = [];
   $mostPopularTripId = null;
   $highestBookingCount = 0;

   foreach ($mostPopularBookings as $booking) {
       $product = $this->stripe->products->retrieve($booking->stripe_product_id);

       $trip = TripsModel::where('stripe_product_id', $booking->stripe_product_id)->first();

select * from `trips` where `trips`.`tripID` = 'c44f9b1c-5dee-4a9e-85f0-27c4e47dc7b2' limit 1
---
    public function bookingPage($tripID){
        try{

            $trip = TripsModel::findOrFail($tripID);

select * from `bookings` where `stripe_checkout_id` = 'cs_test_b1kFNjhaThBR1cJiXEP1zjQs442z9R0TPzOVF5MZxC3Cfs2AK3i6uCbzuA' limit 1
insert into `bookings` (`bookingID`, `tripID`, `name`, `email`, `phone_number`, `address_line_1`, `address_line_2`, `city`, `state`, `zip_code`, `stripe_checkout_id`, `stripe_product_id`, `updated_at`, `created_at`) values ('\"dcedb7c5-fa4b-406f-a789-ee270b4538c7\"', '134632e2-7a76-4330-b79c-a2f73af3eda7', 'Jack Harlow', 'jack.harlow@gmail.com', '860-209-4054', '15 Inwood dr', '', 'Guilford', 'CT', '06437', 'cs_test_b1kFNjhaThBR1cJiXEP1zjQs442z9R0TPzOVF5MZxC3Cfs2AK3i6uCbzuA', 'prod_QpFIsKcGyFemHX', '2024-09-10 20:47:04', '2024-09-10 20:47:04')
---
    public function bookingSuccess(Request $request)
    {
        $tripID = $request->query('tripID');
        $sessionID = $request->query('session_id');

        // Validate tripID and sessionID
        if (empty($tripID) || empty($sessionID)) {
            abort(404, 'Trip ID or Session ID is missing.');
        }

        // Initialize Stripe client
        $stripe = new \Stripe\StripeClient(env('STRIPE_SECRET_KEY'));

        try {
            // Retrieve the Stripe session using the session ID
            $session = $stripe->checkout->sessions->retrieve($sessionID);

            // Check if the session exists and has the correct payment status
            if ($session && $session->payment_status == 'paid') {
                // Check if a booking already exists with the same stripe_checkout_id
                $existingBooking = BookingModel::where('stripe_checkout_id', $session->id)->first();

                if ($existingBooking) {
                    return redirect()->route('booking.cancel', ['tripID' => $tripID])
                                     ->with('message', 'Booking already completed.');
                }

                // Create a new booking record
                BookingModel::create([
                    'bookingID' => $this->bookingID,
                    'tripID' => $session->metadata->tripID ?? null,
                    'name' => $session->metadata->name ?? 'N/A',
                    'email' => $session->metadata->email ?? 'N/A',
                    'phone_number' => $session->metadata->phone_number ?? 'N/A',
                    'address_line_1' => $session->metadata->address_line_1 ?? 'N/A',
                    'address_line_2' => $session->metadata->address_line_2 ?? '',
                    'city' => $session->metadata->city ?? 'N/A',
                    'state' => $session->metadata->state ?? 'N/A',
                    'zip_code' => $session->metadata->zipcode ?? '00000',
                    'stripe_checkout_id' => $session->id,
                    'stripe_product_id' => $session->metadata->stripe_product_id ?? null,
                ]);