app/Http/Controllers/Home.php

select * from `testimonials` where `testimonial_approval_status` = 'Approved'
select `bookings`.`stripe_product_id`, COUNT(*) as booking_count from `bookings` inner join `trips` on `bookings`.`stripe_product_id` = `trips`.`stripe_product_id` group by `bookings`.`stripe_product_id`, `trips`.`tripID`, `trips`.`tripPhoto` having `booking_count` > 2 order by `booking_count` desc limit 4
---
    public function homePage()
    {
        $trips = TripsModel::select('tripID', 'tripLocation', 'tripPhoto', 'tripLandscape', 'tripAvailability', 'tripStartDate', 'tripEndDate', 'tripPrice', 'stripe_product_id')->where('active', true)->get();
        $testimonials = Testimonials::with('trip')->where('testimonial_approval_status', 'Approved')->get();


        $mostPopularBookings = BookingModel::select('bookings.stripe_product_id', DB::raw('COUNT(*) as booking_count'))
            ->join('trips', 'bookings.stripe_product_id', '=', 'trips.stripe_product_id')
            ->groupBy('bookings.stripe_product_id', 'trips.tripID', 'trips.tripPhoto')
            ->having('booking_count', '>', 2)
            ->orderByDesc('booking_count')
            ->take(4)
            ->get();

select * from `trips` where `tripID` = '6880dd2f-d39a-41fe-b424-98b3d439294a' and `active` = 1 limit 1
select * from `testimonials` where `tripID` = '6880dd2f-d39a-41fe-b424-98b3d439294a' and `testimonial_approval_status` = 'approved'
select * from `trips` where `tripID` = '6880dd2f-d39a-41fe-b424-98b3d439294a' limit 1
select `stripe_product_id`, COUNT(*) as booking_count from `bookings` group by `stripe_product_id` having `booking_count` > 2 order by `booking_count` desc limit 1
---
    public function getDestinationDetails($tripID){
        $trip = TripsModel::where('tripID', $tripID)->where('active', true)->firstOrFail();
        $testimonials = Testimonials::with('trip')
            ->where('tripID', $tripID)
            ->where('testimonial_approval_status', 'approved')
            ->get();
        $averageTestimonialRating = $testimonials->isNotEmpty() ? $testimonials->avg('trip_rating') : 0;

        // Retrieve the most popular booking
        $mostPopularBooking = BookingModel::select('stripe_product_id')
            ->selectRaw('COUNT(*) as booking_count')
            ->groupBy('stripe_product_id')
            ->having('booking_count', '>', 2) // only bookings with more than 1 entry are considered
            ->orderByDesc('booking_count')
            ->first();

select * from `trips` where `trips`.`tripID` = '6880dd2f-d39a-41fe-b424-98b3d439294a' limit 1
---
    public function bookingPage($tripID){
        try{

            $trip = TripsModel::findOrFail($tripID);